src/InformationRegisters/ЗакрепленныеСотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>ЗакрепленныеСотрудники</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ЗакрепленныеСотрудники/Ext/ManagerModule.bsl
Функция ПолучитьВыборкуСотрудниковПоТранспортномуСредству(ТранспортноеСредство) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗакрепленныеСотрудникиСрезПоследних.Сотрудник КАК Сотрудник,
		|	ЗакрепленныеСотрудникиСрезПоследних.Сотрудник.Телеграм_ИдЧата КАК ИдЧата
		|ИЗ
		|	РегистрСведений.ЗакрепленныеСотрудники.СрезПоследних(
		|			,
		|			ТранспортноеСредство = &ТранспортноеСредство
		|				И Сотрудник.Телеграм_ИдЧата <> 0) КАК ЗакрепленныеСотрудникиСрезПоследних";
	
	Запрос.УстановитьПараметр("ТранспортноеСредство", ТранспортноеСредство);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выбрать();
	
КонецФункции // ПолучитьСотрудниковПоТранспортномуСредству()

Функция ПолучитьТранспортноеСредствоСотрудника(Сотрудник) Экспорт 

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗакрепленныеСотрудникиСрезПоследних.ТранспортноеСредство КАК ТранспортноеСредство
		|ИЗ
		|	РегистрСведений.ЗакрепленныеСотрудники.СрезПоследних(, Сотрудник = &Сотрудник) КАК ЗакрепленныеСотрудникиСрезПоследних";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
	
		Возврат Выборка.ТранспортноеСредство;	
	
	КонецЕсли; 
	
КонецФункции // ()
